In [27]:
import mypathsetup
import config
import pandas as pd

# distribution_1990_2019

In [28]:
df = pd.read_csv(config.r_income_data / 'distribution_1990_2019.csv')
df

,Sex,Unit,Age,1990,1991,1992,1993,1994,1995,1996,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Total,10%,Total,265,290,288,285,304,329,371,...,924,1058,1148,1238,1294,1393,1576,1775,1915,1958
1,Total,10%,16 - 24 years,170,184,164,148,147,153,177,...,200,245,280,329,326,384,468,550,540,464
2,Total,10%,16 - 64 years,253,275,272,266,286,309,352,...,824,949,1028,1111,1155,1234,1401,1591,1697,1727
3,Total,10%,16 - 74 years,262,286,284,280,300,325,368,...,893,1026,1112,1201,1255,1350,1531,1730,1856,1894
4,Total,10%,18 - 66 years,298,325,331,328,355,393,442,...,1139,1232,1326,1411,1507,1634,1834,1995,2140,2199
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
424,Women,Number - conditional,25 - 64 years,54957,56268,57293,58119,58777,59040,59275,...,74495,74328,74627,75309,75984,76868,77402,78301,79812,81893
425,Women,Number - conditional,25 - 74 years,62959,64486,65657,66620,67485,67972,68284,...,84557,84667,85408,86652,87764,89007,89999,91234,93174,95710
426,Women,Number - conditional,55 - 74 years,17897,18137,18245,18316,18453,18582,18630,...,26010,26766,27688,28635,29580,30354,30991,31726,32452,33448
427,Women,Number - conditional,67 years and older,12809,13150,13400,13670,14007,14220,14466,...,17897,18135,18617,19127,19573,20016,20431,20864,21403,22028
428,Women,Number - conditional,75 years and older,6517,6741,6924,7046,7193,7341,7513,...,10332,10361,10477,10638,10704,10760,10857,10978,11183,11472

In [29]:
df.Unit.unique()

array(['10%', '20%', '30%', '40%', '50%', '60%', '70%', '80%', '90%',
       '95%', '99%', 'Mean - conditional', 'Number - conditional'],
      dtype=object)

In [30]:
df = pd.melt(df, id_vars=['Sex', 'Unit', 'Age'], var_name=['Year'], value_name='value')
df

         Sex                  Unit                 Age  Year  value
0      Total                   10%               Total  1990    265
1      Total                   10%       16 - 24 years  1990    170
2      Total                   10%       16 - 64 years  1990    253
3      Total                   10%       16 - 74 years  1990    262
4      Total                   10%       18 - 66 years  1990    298
...      ...                   ...                 ...   ...    ...
12865  Women  Number - conditional       25 - 64 years  2019  81893
12866  Women  Number - conditional       25 - 74 years  2019  95710
12867  Women  Number - conditional       55 - 74 years  2019  33448
12868  Women  Number - conditional  67 years and older  2019  22028
12869  Women  Number - conditional  75 years and older  2019  11472

[12870 rows x 5 columns]

In [31]:
# multiply income amounts by 100 to get correct amount in ISK
def change_income(unit, income):
    if unit != 'Number - conditional':
        new_inc = income * 100
        return(new_inc)
    return(income)

df.value = df.apply(lambda x: change_income(x.Unit, x.value), axis=1)
df

         Sex                  Unit                 Age  Year  value
0      Total                   10%               Total  1990  26500
1      Total                   10%       16 - 24 years  1990  17000
2      Total                   10%       16 - 64 years  1990  25300
3      Total                   10%       16 - 74 years  1990  26200
4      Total                   10%       18 - 66 years  1990  29800
...      ...                   ...                 ...   ...    ...
12865  Women  Number - conditional       25 - 64 years  2019  81893
12866  Women  Number - conditional       25 - 74 years  2019  95710
12867  Women  Number - conditional       55 - 74 years  2019  33448
12868  Women  Number - conditional  67 years and older  2019  22028
12869  Women  Number - conditional  75 years and older  2019  11472

[12870 rows x 5 columns]

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12870 entries, 0 to 12869
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sex     12870 non-null  object
 1   Unit    12870 non-null  object
 2   Age     12870 non-null  object
 3   Year    12870 non-null  object
 4   value   12870 non-null  int64
dtypes: int64(1), object(4)
memory usage: 502.9+ KB

In [33]:
# reorder columns
df = df[['Year', 'Sex', 'Age', 'Unit', 'value']]
df

       Year    Sex                 Age                  Unit  value
0      1990  Total               Total                   10%  26500
1      1990  Total       16 - 24 years                   10%  17000
2      1990  Total       16 - 64 years                   10%  25300
3      1990  Total       16 - 74 years                   10%  26200
4      1990  Total       18 - 66 years                   10%  29800
...     ...    ...                 ...                   ...    ...
12865  2019  Women       25 - 64 years  Number - conditional  81893
12866  2019  Women       25 - 74 years  Number - conditional  95710
12867  2019  Women       55 - 74 years  Number - conditional  33448
12868  2019  Women  67 years and older  Number - conditional  22028
12869  2019  Women  75 years and older  Number - conditional  11472

[12870 rows x 5 columns]

In [34]:
# to csv
data_path = config.c_income_data / 'distribution_1990_2019.csv'
df.to_csv(data_path, index=False)

# distribution_sector_2014_2018

In [62]:
df = pd.read_csv(config.r_income_data / 'distribution_sector_2014_2018.csv')
df

,Year,Economic activity,Occupational group,Sex,Earnings and working hours,Mean,10%,20%,25% (1st quartile),30%,40%,50% (median),60%,70%,75% (3rd quartile),80%,90%,Observations,Weighted bservations
0,2014,Total,Total,Total,Total earnings,563,321,375,396,415,452,493,540,602,644,694,852,39190,56460
1,2014,Total,Total,Total,Hours paid,184.5,162.5,170.9,173.3,173.3,173.8,178.1,183.3,189.1,193.2,197.5,212.7,39190.0,56460.0
2,2014,Total,Total,Men,Total earnings,625,353,410,434,456,500,544,598,667,714,767,932,19230,30070
3,2014,Total,Total,Men,Hours paid,188.6,162.5,171.5,173.3,173.3,175.4,182.7,188.8,195.7,200.4,206.2,220.4,19230.0,30070.0
4,2014,Total,Total,Women,Total earnings,492,296,346,367,384,415,446,480,527,557,596,728,19950,26390
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4285,2018,Human health and social work activities (Q),"General, machine and specialized workers",Total,Hours paid,191.8,170.3,174.9,176.5,181.0,184.9,189.1,193.6,198.7,202.6,206.9,217.2,320.0,310.0
4286,2018,Human health and social work activities (Q),"General, machine and specialized workers",Men,Total earnings,571,366,424,433,455,478,516,570,624,646,678,886,130,130
4287,2018,Human health and social work activities (Q),"General, machine and specialized workers",Men,Hours paid,199.0,173.8,182.4,184.7,188.3,192.7,196.5,204.6,210.9,214.0,215.3,226.8,130.0,130.0
4288,2018,Human health and social work activities (Q),"General, machine and specialized workers",Women,Total earnings,436,344,376,387,392,407,427,449,467,478,487,551,190,180
4289,2018,Human health and social work activities (Q),"General, machine and specialized workers",Women,Hours paid,186.8,170.0,173.3,174.6,175.4,181.4,184.9,188.3,193.5,195.4,197.5,206.7,190.0,180.0

In [36]:
df['Economic activity'].unique()

array(['Total', 'Manufacturing (C)',
       'Electricity, gas, steam, and air conditioning supply (D)',
       'Water supply; sewerage, waste management etc. (E)',
       'Construction (F)',
       'Wholesale and retail trade; repair of motor vehicles (G)',
       'Transportation and storage (H)',
       'Accommodation and food service activites (I)',
       'Information and communication (J)',
       'Financial and insurance activities (K)',
       'Public administration and defence; compulsory social sec. (O)',
       'Education (P)', 'Human health and social work activities (Q)'],
      dtype=object)

In [63]:
# rename to sector
df = df.rename(columns={'Economic activity': 'sector'})

# remove last letter
def remove_last_letter(sector):
    split_words = sector.split()
    if len(split_words) > 1:
        letter_removed = split_words[:-1]
        formatted_sector = ' '.join(letter_removed)
        return(formatted_sector)
    return(sector)

df['sector'] = df.sector.apply(remove_last_letter)

df

,Year,sector,Occupational group,Sex,Earnings and working hours,Mean,10%,20%,25% (1st quartile),30%,40%,50% (median),60%,70%,75% (3rd quartile),80%,90%,Observations,Weighted bservations
0,2014,Total,Total,Total,Total earnings,563,321,375,396,415,452,493,540,602,644,694,852,39190,56460
1,2014,Total,Total,Total,Hours paid,184.5,162.5,170.9,173.3,173.3,173.8,178.1,183.3,189.1,193.2,197.5,212.7,39190.0,56460.0
2,2014,Total,Total,Men,Total earnings,625,353,410,434,456,500,544,598,667,714,767,932,19230,30070
3,2014,Total,Total,Men,Hours paid,188.6,162.5,171.5,173.3,173.3,175.4,182.7,188.8,195.7,200.4,206.2,220.4,19230.0,30070.0
4,2014,Total,Total,Women,Total earnings,492,296,346,367,384,415,446,480,527,557,596,728,19950,26390
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4285,2018,Human health and social work activities,"General, machine and specialized workers",Total,Hours paid,191.8,170.3,174.9,176.5,181.0,184.9,189.1,193.6,198.7,202.6,206.9,217.2,320.0,310.0
4286,2018,Human health and social work activities,"General, machine and specialized workers",Men,Total earnings,571,366,424,433,455,478,516,570,624,646,678,886,130,130
4287,2018,Human health and social work activities,"General, machine and specialized workers",Men,Hours paid,199.0,173.8,182.4,184.7,188.3,192.7,196.5,204.6,210.9,214.0,215.3,226.8,130.0,130.0
4288,2018,Human health and social work activities,"General, machine and specialized workers",Women,Total earnings,436,344,376,387,392,407,427,449,467,478,487,551,190,180
4289,2018,Human health and social work activities,"General, machine and specialized workers",Women,Hours paid,186.8,170.0,173.3,174.6,175.4,181.4,184.9,188.3,193.5,195.4,197.5,206.7,190.0,180.0

In [39]:
df['Occupational group'].unique()

array(['Total', 'Managers (1)', 'Professionals (2)',
       'Technicians and associate professionals (3)', 'Clerks (4)',
       'Service workers and shop and market sales workers (5)',
       'Craft and related trades workers (7)',
       'Plant and machine operators and assemblers (8)',
       'Elementary occupations (9)', 'Craft workers',
       'General, machine and specialized workers'], dtype=object)

In [64]:
# format occupational group by also removing last number
remove_last_number = remove_last_letter

df['Occupational group'] = df['Occupational group'].apply(remove_last_number)

df['Occupational group'].unique()

array(['Total', 'Managers', 'Professionals',
       'Technicians and associate professionals', 'Clerks',
       'Service workers and shop and market sales workers',
       'Craft and related trades workers',
       'Plant and machine operators and assemblers',
       'Elementary occupations', 'Craft',
       'General, machine and specialized'], dtype=object)

In [42]:
df['Earnings and working hours'].unique()

array(['Total earnings', 'Hours paid'], dtype=object)

In [65]:
df = pd.melt(
    df, 
    id_vars=['Year', 'Sex', 'sector', 'Occupational group', 'Earnings and working hours'], 
    var_name='Unit', 
    value_name='Value')
df

,Year,Sex,sector,Occupational group,Earnings and working hours,Unit,Value
0,2014,Total,Total,Total,Total earnings,Mean,563
1,2014,Total,Total,Total,Hours paid,Mean,184.5
2,2014,Men,Total,Total,Total earnings,Mean,625
3,2014,Men,Total,Total,Hours paid,Mean,188.6
4,2014,Women,Total,Total,Total earnings,Mean,492
...,...,...,...,...,...,...,...
60055,2018,Total,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted bservations,310.0
60056,2018,Men,Human health and social work activities,"General, machine and specialized",Total earnings,Weighted bservations,130
60057,2018,Men,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted bservations,130.0
60058,2018,Women,Human health and social work activities,"General, machine and specialized",Total earnings,Weighted bservations,180
60059,2018,Women,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted bservations,180.0

In [46]:
df.Unit.unique()

array(['Mean', '10%', '20%', '25% (1st quartile)', '30%', '40%',
       '50% (median)', '60%', '70%', '75% (3rd quartile)', '80%', '90%',
       'Observations', 'Weighted bservations'], dtype=object)

In [66]:
# rename weighted observations to fix typo
df['Unit'] = df.Unit.apply(lambda x: 'Weighted observations' if x == 'Weighted bservations' else x)
df.Unit.unique()

array(['Mean', '10%', '20%', '25% (1st quartile)', '30%', '40%',
       '50% (median)', '60%', '70%', '75% (3rd quartile)', '80%', '90%',
       'Observations', 'Weighted observations'], dtype=object)

In [50]:
df.columns

Index(['Year', 'Sex', 'sector', 'Occupational group',
       'Earnings and working hours', 'Unit', 'Value'],
      dtype='object')

In [52]:
df

,Year,Sex,sector,Occupational group,Earnings and working hours,Unit,Value
0,2014,Total,Total,Total,Total earnings,Mean,563
1,2014,Total,Total,Total,Hours paid,Mean,184.5
2,2014,Men,Total,Total,Total earnings,Mean,625
3,2014,Men,Total,Total,Hours paid,Mean,188.6
4,2014,Women,Total,Total,Total earnings,Mean,492
...,...,...,...,...,...,...,...
60055,2018,Total,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted observations,310.0
60056,2018,Men,Human health and social work activities,"General, machine and specialized",Total earnings,Weighted observations,130
60057,2018,Men,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted observations,130.0
60058,2018,Women,Human health and social work activities,"General, machine and specialized",Total earnings,Weighted observations,180
60059,2018,Women,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted observations,180.0

In [53]:
# multiply by 1000 if earnings = 'Total earnings' and unit != 'Weighted observations'
def format_income(cat, unit, value):
    if cat == 'Total earnings' and unit not in ['Observations', 'Weighted observations']:
        formatted_income = value * 1000
        return(formatted_income)
    return(value)

df.apply(
    lambda x: format_income(
        x['Earnings and working hours'], 
        x['Unit'],
        x['Value']
    ),
    axis=1 
)

0        5635635635635635635635635635635635635635635635...
1                                                    184.5
2        6256256256256256256256256256256256256256256256...
3                                                    188.6
4        4924924924924924924924924924924924924924924924...
                               ...
60055                                                310.0
60056                                                  130
60057                                                130.0
60058                                                  180
60059                                                180.0
Length: 60060, dtype: object

In [54]:
# format value as float, then try again
df['Value'].astype(float)

ValueError: could not convert string to float: '.'

In [55]:
df[df['Value'] == '.']

,Year,Sex,sector,Occupational group,Earnings and working hours,Unit,Value
56,2014,Men,Total,Craft,Total earnings,Mean,.
57,2014,Men,Total,Craft,Hours paid,Mean,.
58,2014,Women,Total,Craft,Total earnings,Mean,.
59,2014,Women,Total,Craft,Hours paid,Mean,.
92,2014,Men,Manufacturing,Clerks,Total earnings,Mean,.
...,...,...,...,...,...,...,...
60049,2018,Total,Human health and social work activities,Craft,Hours paid,Weighted observations,.
60050,2018,Men,Human health and social work activities,Craft,Total earnings,Weighted observations,.
60051,2018,Men,Human health and social work activities,Craft,Hours paid,Weighted observations,.
60052,2018,Women,Human health and social work activities,Craft,Total earnings,Weighted observations,.
60053,2018,Women,Human health and social work activities,Craft,Hours paid,Weighted observations,.

In [67]:
df['Value'] = df['Value'].apply(lambda x: float('NaN') if x == '.' else x)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60060 entries, 0 to 60059
Data columns (total 7 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Year                        60060 non-null  int64
 1   Sex                         60060 non-null  object
 2   sector                      60060 non-null  object
 3   Occupational group          60060 non-null  object
 4   Earnings and working hours  60060 non-null  object
 5   Unit                        60060 non-null  object
 6   Value                       31808 non-null  object
dtypes: int64(1), object(6)
memory usage: 3.2+ MB

In [68]:
df['Value'] = df['Value'].astype(float)
df['Value']

0        563.0
1        184.5
2        625.0
3        188.6
4        492.0
         ...
60055    310.0
60056    130.0
60057    130.0
60058    180.0
60059    180.0
Name: Value, Length: 60060, dtype: float64

In [69]:
df['Value'] = df.apply(
        lambda x: format_income(
            x['Earnings and working hours'], 
            x['Unit'],
            x['Value']
        ),
        axis=1 
    )

df

,Year,Sex,sector,Occupational group,Earnings and working hours,Unit,Value
0,2014,Total,Total,Total,Total earnings,Mean,563000.0
1,2014,Total,Total,Total,Hours paid,Mean,184.5
2,2014,Men,Total,Total,Total earnings,Mean,625000.0
3,2014,Men,Total,Total,Hours paid,Mean,188.6
4,2014,Women,Total,Total,Total earnings,Mean,492000.0
...,...,...,...,...,...,...,...
60055,2018,Total,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted observations,310.0
60056,2018,Men,Human health and social work activities,"General, machine and specialized",Total earnings,Weighted observations,130.0
60057,2018,Men,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted observations,130.0
60058,2018,Women,Human health and social work activities,"General, machine and specialized",Total earnings,Weighted observations,180.0
60059,2018,Women,Human health and social work activities,"General, machine and specialized",Hours paid,Weighted observations,180.0

In [70]:
# to csv
data_path = config.c_income_data / 'distribution_sector_2014_2018.csv'
df.to_csv(data_path, index=False)

# income_by_education_sex_age_1990_2018

In [99]:
df = pd.read_csv(config.r_income_data / 'income_by_education_sex_age_1990_2018.csv')
df

,Income and taxes,Unit,Education,Sex,Age,1990,1991,1992,1993,1994,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Total annual income,Mean - total,Total,Total,Total,1116,1224,1235,1237,1272,...,4347,4019,4316,4524,4782,5089,5407,5911,6419,6641
1,Total annual income,Mean - total,Total,Total,16 - 24 years,625,670,648,630,647,...,1501,1495,1631,1752,1867,1959,2123,2359,2587,2729
2,Total annual income,Mean - total,Total,Total,25 - 54 years,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..
3,Total annual income,Mean - total,Total,Total,55 - 74 years,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..
4,Total annual income,Mean - total,Total,Total,67 years and over,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2875,Disposable income,Standard deviation - total,Doctoral or equivalent level,Women,16 - 24 years,.,.,.,.,.,...,.,.,.,.,.,.,.,.,.,.
2876,Disposable income,Standard deviation - total,Doctoral or equivalent level,Women,25 - 54 years,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..
2877,Disposable income,Standard deviation - total,Doctoral or equivalent level,Women,55 - 74 years,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..
2878,Disposable income,Standard deviation - total,Doctoral or equivalent level,Women,67 years and over,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..
2879,Disposable income,Standard deviation - total,Doctoral or equivalent level,Women,75 years and over,.,.,.,.,.,...,.,.,.,.,.,.,.,.,.,.

In [78]:
df['Income and taxes'].unique()

array(['Total annual income', 'Income from work', 'Taxes',
       'Disposable income'], dtype=object)

In [72]:
df.Unit.unique()

array(['Mean - total', 'Median - total', 'Number - total',
       'Standard deviation - total'], dtype=object)

In [73]:
df.Education.unique()

array(['Total', 'Basic education', 'Upper secondary education',
       '- Vocational education at the upper secondary level',
       '- General education at the upper secondary level',
       'Tertiary education', '- Short-cycle tertiary education',
       '- Bachelorï¿½s or equivalent level',
       '- Masterï¿½s or equivalent level', 'Doctoral or equivalent level'],
      dtype=object)

In [100]:
def format_education(edu):
    if edu == '- Vocational education at the upper secondary level':
        new_edu = 'Upper secondary education: vocational'
        return(new_edu)
    if edu == '- General education at the upper secondary level':
        new_edu = 'Upper secondary education: general'
        return(new_edu)
    if edu == '- Short-cycle tertiary education':
        new_edu = 'Short-cycle tertiary education'
        return(new_edu)
    if edu == '- Bachelorï¿½s or equivalent level':
        new_edu = "Bachelor's or equivalent level"
        return(new_edu)
    if edu == '- Masterï¿½s or equivalent level':
        new_edu = "Master's or equivalent level"
        return(new_edu)

    return(edu)

df['Education'] = df.Education.apply(format_education)
df.Education.unique()

array(['Total', 'Basic education', 'Upper secondary education',
       'Upper secondary education: vocational',
       'Upper secondary education: general', 'Tertiary education',
       'Short-cycle tertiary education', "Bachelor's or equivalent level",
       "Master's or equivalent level", 'Doctoral or equivalent level'],
      dtype=object)

In [101]:
df = pd.melt(
    df, 
    id_vars=['Sex', 'Age', 'Education', 'Income and taxes', 'Unit'], 
    var_name='Year', 
    value_name='Value')

df

,Sex,Age,Education,Income and taxes,Unit,Year,Value
0,Total,Total,Total,Total annual income,Mean - total,1990,1116
1,Total,16 - 24 years,Total,Total annual income,Mean - total,1990,625
2,Total,25 - 54 years,Total,Total annual income,Mean - total,1990,..
3,Total,55 - 74 years,Total,Total annual income,Mean - total,1990,..
4,Total,67 years and over,Total,Total annual income,Mean - total,1990,..
...,...,...,...,...,...,...,...
83515,Women,16 - 24 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,.
83516,Women,25 - 54 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,..
83517,Women,55 - 74 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,..
83518,Women,67 years and over,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,..
83519,Women,75 years and over,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,.

In [102]:
# format value column
df['Value'] = df.Value.apply(lambda x: float('NaN') if x in ['.', '..'] else int(x)*1000)

df

,Sex,Age,Education,Income and taxes,Unit,Year,Value
0,Total,Total,Total,Total annual income,Mean - total,1990,1116000.0
1,Total,16 - 24 years,Total,Total annual income,Mean - total,1990,625000.0
2,Total,25 - 54 years,Total,Total annual income,Mean - total,1990,NaN
3,Total,55 - 74 years,Total,Total annual income,Mean - total,1990,NaN
4,Total,67 years and over,Total,Total annual income,Mean - total,1990,NaN
...,...,...,...,...,...,...,...
83515,Women,16 - 24 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,NaN
83516,Women,25 - 54 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,NaN
83517,Women,55 - 74 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,NaN
83518,Women,67 years and over,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,NaN
83519,Women,75 years and over,Doctoral or equivalent level,Disposable income,Standard deviation - total,2018,NaN

In [103]:
# reorder columns
df = df[['Year', 'Sex', 'Age', 'Education', 'Income and taxes', 'Unit', 'Value']]
df

,Year,Sex,Age,Education,Income and taxes,Unit,Value
0,1990,Total,Total,Total,Total annual income,Mean - total,1116000.0
1,1990,Total,16 - 24 years,Total,Total annual income,Mean - total,625000.0
2,1990,Total,25 - 54 years,Total,Total annual income,Mean - total,NaN
3,1990,Total,55 - 74 years,Total,Total annual income,Mean - total,NaN
4,1990,Total,67 years and over,Total,Total annual income,Mean - total,NaN
...,...,...,...,...,...,...,...
83515,2018,Women,16 - 24 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,NaN
83516,2018,Women,25 - 54 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,NaN
83517,2018,Women,55 - 74 years,Doctoral or equivalent level,Disposable income,Standard deviation - total,NaN
83518,2018,Women,67 years and over,Doctoral or equivalent level,Disposable income,Standard deviation - total,NaN
83519,2018,Women,75 years and over,Doctoral or equivalent level,Disposable income,Standard deviation - total,NaN

In [104]:
# drop missing data
df = df.dropna()

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30624 entries, 0 to 83514
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Year              30624 non-null  object
 1   Sex               30624 non-null  object
 2   Age               30624 non-null  object
 3   Education         30624 non-null  object
 4   Income and taxes  30624 non-null  object
 5   Unit              30624 non-null  object
 6   Value             30624 non-null  float64
dtypes: float64(1), object(6)
memory usage: 1.9+ MB

In [106]:
# to csv
data_path = config.c_income_data / 'income_by_education_sex_age_1990_2018.csv'
df.to_csv(data_path, index=False)

# income_by_municipality_1990_2019

In [109]:
df = pd.read_csv(config.r_income_data / 'income_by_municipality_1990_2019.csv', encoding='ISO-8859-1')
df

,Income,Unit,Sex,Municipality,1990,1991,1992,1993,1994,1995,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Total annual income,Mean - total,Total,Total,1116,1223,1235,1236,1271,1339,...,4018,4315,4522,4781,5088,5405,5910,6418,6641,6871
1,Total annual income,Mean - total,Total,ReykjavÃ­k,1126,1242,1253,1253,1286,1350,...,4044,4319,4536,4852,5138,5429,5916,6466,6719,6877
2,Total annual income,Mean - total,Total,KÃ³pavogur,1128,1238,1254,1252,1302,1373,...,4301,4630,4809,5056,5444,5760,6422,6902,7156,7357
3,Total annual income,Mean - total,Total,Seltjarnarnes,1299,1448,1485,1466,1527,1604,...,4867,5313,5445,5705,6072,6646,7967,8128,8485,8796
4,Total annual income,Mean - total,Total,GarÃ°abÃ¦r,1301,1435,1446,1430,1472,1543,...,4852,5288,5484,5887,6226,6821,7441,8176,8358,8694
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2623,Disposable income,Standard deviation - total,Women,SveitarfÃ©lagiÃ° Ã–lfus,320,362,403,377,379,462,...,1282,1749,2209,1489,1529,1728,36774,6799,2161,2351
2624,Disposable income,Standard deviation - total,Women,GrÃ­msnes- og Grafningshreppur,385,422,1311,472,301,307,...,1237,1160,1759,1451,1408,1838,1611,2448,2229,2970
2625,Disposable income,Standard deviation - total,Women,SkeiÃ°a- og GnÃºpverjahreppur,281,329,340,386,372,417,...,1232,1264,3381,1979,1953,2169,2409,4710,1876,2663
2626,Disposable income,Standard deviation - total,Women,BlÃ¡skÃ³gabyggÃ°,305,341,389,545,391,610,...,1416,1466,1278,1437,1398,2783,1915,8181,2771,7005
2627,Disposable income,Standard deviation - total,Women,FlÃ³ahreppur,276,302,304,308,272,305,...,1726,1461,1386,1556,1605,1755,1705,2821,2895,2517

In [111]:
df = pd.melt(df, id_vars=['Income', 'Unit', 'Sex', 'Municipality'], var_name='Year', value_name='Value')
df

,Income,Unit,Sex,Municipality,Year,Value
0,Total annual income,Mean - total,Total,Total,1990,1116
1,Total annual income,Mean - total,Total,ReykjavÃ­k,1990,1126
2,Total annual income,Mean - total,Total,KÃ³pavogur,1990,1128
3,Total annual income,Mean - total,Total,Seltjarnarnes,1990,1299
4,Total annual income,Mean - total,Total,GarÃ°abÃ¦r,1990,1301
...,...,...,...,...,...,...
78835,Disposable income,Standard deviation - total,Women,SveitarfÃ©lagiÃ° Ã–lfus,2019,2351
78836,Disposable income,Standard deviation - total,Women,GrÃ­msnes- og Grafningshreppur,2019,2970
78837,Disposable income,Standard deviation - total,Women,SkeiÃ°a- og GnÃºpverjahreppur,2019,2663
78838,Disposable income,Standard deviation - total,Women,BlÃ¡skÃ³gabyggÃ°,2019,7005
78839,Disposable income,Standard deviation - total,Women,FlÃ³ahreppur,2019,2517

In [116]:
# format value
df['Value'] = df.Value.apply(lambda x: x*1000)
df

,Income,Unit,Sex,Municipality,Year,Value
0,Total annual income,Mean - total,Total,Total,1990,1116000
1,Total annual income,Mean - total,Total,ReykjavÃ­k,1990,1126000
2,Total annual income,Mean - total,Total,KÃ³pavogur,1990,1128000
3,Total annual income,Mean - total,Total,Seltjarnarnes,1990,1299000
4,Total annual income,Mean - total,Total,GarÃ°abÃ¦r,1990,1301000
...,...,...,...,...,...,...
78835,Disposable income,Standard deviation - total,Women,SveitarfÃ©lagiÃ° Ã–lfus,2019,2351000
78836,Disposable income,Standard deviation - total,Women,GrÃ­msnes- og Grafningshreppur,2019,2970000
78837,Disposable income,Standard deviation - total,Women,SkeiÃ°a- og GnÃºpverjahreppur,2019,2663000
78838,Disposable income,Standard deviation - total,Women,BlÃ¡skÃ³gabyggÃ°,2019,7005000
78839,Disposable income,Standard deviation - total,Women,FlÃ³ahreppur,2019,2517000

In [117]:
# to csv
data_path = config.c_income_data / 'income_by_municipality_1990_2019.csv'
df.to_csv(data_path, index=False)

# risk_of_poverty_2004_2018.csv

In [118]:
df = pd.read_csv(config.r_income_data / 'risk_of_poverty_2004_2018.csv')
df

,Year,Sex,Age,Rate of individuals (%),Rate lower bounds (%),Rate upper bounds (%),Number of individuals,Number lower bounds,Number upper bounds
0,2004,Total,Total,10.0,9.3,10.8,28100,26034,30260
1,2004,Total,0-15 years old,11.8,10.3,13.3,8186,7188,9259
2,2004,Total,16-24 years old,14.7,12.4,17.1,5313,4500,6202
3,2004,Total,25-34 years old,10.8,8.8,13.1,4201,3411,5090
4,2004,Total,35-44 years old,9.1,7.4,11.0,3763,3059,4557
...,...,...,...,...,...,...,...,...,...
355,2018,Male,25-34 years old,12.3,8.7,16.6,3274,2324,4416
356,2018,Male,35-44 years old,9.5,6.5,13.3,2175,1483,3031
357,2018,Male,45-54 years old,6.0,3.5,9.4,1268,737,1989
358,2018,Male,55-64 years old,9.4,5.7,14.4,2049,1233,3122
359,2018,Male,65 + years old,5.8,3.1,9.6,1384,737,2305

In [120]:
df = pd.melt(df, id_vars=['Year', 'Sex', 'Age'], var_name='Unit', value_name='Value')
df

      Year    Sex              Age                     Unit   Value
0     2004  Total            Total  Rate of individuals (%)    10.0
1     2004  Total   0-15 years old  Rate of individuals (%)    11.8
2     2004  Total  16-24 years old  Rate of individuals (%)    14.7
3     2004  Total  25-34 years old  Rate of individuals (%)    10.8
4     2004  Total  35-44 years old  Rate of individuals (%)     9.1
...    ...    ...              ...                      ...     ...
2155  2018   Male  25-34 years old      Number upper bounds  4416.0
2156  2018   Male  35-44 years old      Number upper bounds  3031.0
2157  2018   Male  45-54 years old      Number upper bounds  1989.0
2158  2018   Male  55-64 years old      Number upper bounds  3122.0
2159  2018   Male   65 + years old      Number upper bounds  2305.0

[2160 rows x 5 columns]

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2160 entries, 0 to 2159
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    2160 non-null   int64
 1   Sex     2160 non-null   object
 2   Age     2160 non-null   object
 3   Unit    2160 non-null   object
 4   Value   2160 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 84.5+ KB

In [122]:
# formot year as str
df.Year = df.Year.astype(str)

In [123]:
# to csv
data_path = config.c_income_data / 'risk_of_poverty_2004_2018.csv'
df.to_csv(data_path, index=False)

# youth_median_monthly_inc_2005_2017.csv

In [124]:
df = pd.read_csv(config.r_income_data / 'youth_median_monthly_inc_2005_2017.csv')
df

,Year,5 years and younger Boys,5 years and younger Girls,6 - 12 years old Boys,6 - 12 years old Girls,13 years old and older Boys,13 years old and older Girls
0,2005,11000,11000,11000,10000,45000,44000
1,2006,12000,12000,12000,12000,50000,48000
2,2007,13000,13000,13000,13000,57000,51000
3,2008,14000,14000,14000,14000,55000,50000
4,2009,15000,15000,15000,15000,49000,48000
5,2010,16000,16000,16000,16000,53000,53000
6,2011,16000,16000,16000,16000,52000,56000
7,2012,17000,17000,17000,17000,58000,62000
8,2013,18000,18000,18000,18000,60000,63000
9,2014,18000,18000,18000,18000,63000,67000
10,2015,19000,18000,18000,19000,72000,72000
11,2016,19000,19000,19000,19000,79000,78000
12,2017,19000,19000,19000,19000,84000,80000

In [ ]:
# need boys/girls dimension, age dimension, median_monthly_inc measure

In [126]:
df = pd.melt(df, id_vars='Year', var_name='Sex', value_name='median_monthly_inc')
df

    Year                           Sex  median_monthly_inc
0   2005      5 years and younger Boys               11000
1   2006      5 years and younger Boys               12000
2   2007      5 years and younger Boys               13000
3   2008      5 years and younger Boys               14000
4   2009      5 years and younger Boys               15000
..   ...                           ...                 ...
73  2013  13 years old and older Girls               63000
74  2014  13 years old and older Girls               67000
75  2015  13 years old and older Girls               72000
76  2016  13 years old and older Girls               78000
77  2017  13 years old and older Girls               80000

[78 rows x 3 columns]

In [127]:
# create age column
def get_age(cat):
    split_words = cat.split()
    split_words.pop(-1) # remove sex
    age = ' '.join(split_words)
    return(age)

df['Age'] = df.Sex.apply(get_age)
df

,Year,Sex,median_monthly_inc,Age
0,2005,5 years and younger Boys,11000,5 years and younger
1,2006,5 years and younger Boys,12000,5 years and younger
2,2007,5 years and younger Boys,13000,5 years and younger
3,2008,5 years and younger Boys,14000,5 years and younger
4,2009,5 years and younger Boys,15000,5 years and younger
...,...,...,...,...
73,2013,13 years old and older Girls,63000,13 years old and older
74,2014,13 years old and older Girls,67000,13 years old and older
75,2015,13 years old and older Girls,72000,13 years old and older
76,2016,13 years old and older Girls,78000,13 years old and older
77,2017,13 years old and older Girls,80000,13 years old and older

In [128]:
# format sex column
def get_sex(cat):
    split_words = cat.split()
    sex = split_words.pop(-1)
    return(sex)

df.Sex = df.Sex.apply(get_sex)
df

    Year    Sex  median_monthly_inc                     Age
0   2005   Boys               11000     5 years and younger
1   2006   Boys               12000     5 years and younger
2   2007   Boys               13000     5 years and younger
3   2008   Boys               14000     5 years and younger
4   2009   Boys               15000     5 years and younger
..   ...    ...                 ...                     ...
73  2013  Girls               63000  13 years old and older
74  2014  Girls               67000  13 years old and older
75  2015  Girls               72000  13 years old and older
76  2016  Girls               78000  13 years old and older
77  2017  Girls               80000  13 years old and older

[78 rows x 4 columns]

In [129]:
df = df[['Year', 'Sex', 'Age', 'median_monthly_inc']]
df

    Year    Sex                     Age  median_monthly_inc
0   2005   Boys     5 years and younger               11000
1   2006   Boys     5 years and younger               12000
2   2007   Boys     5 years and younger               13000
3   2008   Boys     5 years and younger               14000
4   2009   Boys     5 years and younger               15000
..   ...    ...                     ...                 ...
73  2013  Girls  13 years old and older               63000
74  2014  Girls  13 years old and older               67000
75  2015  Girls  13 years old and older               72000
76  2016  Girls  13 years old and older               78000
77  2017  Girls  13 years old and older               80000

[78 rows x 4 columns]

In [130]:
# to csv
data_path = config.c_income_data / 'youth_median_monthly_inc_2005_2017.csv'
df.to_csv(data_path, index=False)